DRL_py/env/base_case/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  com                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

	cylinder
	{
		type            exprFixedValue;
		value           $internalField;
		amplitude       5.0;
		frequency		6.0;

        valueExpr      "(vector(0, 0, 1) ^ face()) / area() * $amplitude * sin(2 * pi() * $frequency * time())";

	}
    
    "(top|bottom)"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
